# MaterialAssetParamCommonSharedAsset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialAssetParamCommonSharedAsset Property
ParameterTypeId Class See Also
---
"Sharing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialAssetParamCommonSharedAsset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialAssetParamCommonSharedAsset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialAssetParamCommonSharedAsset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace